In [19]:
import pandas as pd

In [20]:
dfe = pd.read_csv("Employees.csv")

In [21]:
dfe

   Employee_ID    Name Department   Salary   Join_Date
0            1    Amit         IT  60000.0  2022-05-10
1            2    Neha         HR      NaN  2021-03-12
2            3   Rahul         IT  55000.0  2020-08-01
3            4  Simran    Finance  72000.0  2023-01-15
4            5   Arjun  Marketing  50000.0  2021-11-21
5            6   Pooja         HR  50000.0  2020-12-09
6            7   Varun         IT  62000.0  2022-09-30

In [22]:
avrage_sal = dfe["Salary"].sum()/dfe["Salary"].count()
avrage_sal = round(avrage_sal, 1)

In [23]:
avrage_sal

58166.7

In [24]:
dfe.fillna({"Salary":avrage_sal})

   Employee_ID    Name Department   Salary   Join_Date
0            1    Amit         IT  60000.0  2022-05-10
1            2    Neha         HR  58166.7  2021-03-12
2            3   Rahul         IT  55000.0  2020-08-01
3            4  Simran    Finance  72000.0  2023-01-15
4            5   Arjun  Marketing  50000.0  2021-11-21
5            6   Pooja         HR  50000.0  2020-12-09
6            7   Varun         IT  62000.0  2022-09-30

In [25]:
[dfe.groupby("Department")["Salary"].mean()]

[Department
 Finance      72000.0
 HR           50000.0
 IT           59000.0
 Marketing    50000.0
 Name: Salary, dtype: float64]

In [26]:
dfe["Join_Date"] = pd.to_datetime(dfe["Join_Date"])

In [27]:
dfe.dtypes

Employee_ID             int64
Name                   object
Department             object
Salary                float64
Join_Date      datetime64[ns]
dtype: object

In [28]:
dfe.loc[dfe["Join_Date"].dt.year > 2021, ["Join_Date", "Name"]]

   Join_Date    Name
0 2022-05-10    Amit
3 2023-01-15  Simran
6 2022-09-30   Varun